{
  "player_details": {
    "wagon-0": {},
    "wagon-1": {
      "player-1": {
        "profile": {
          "name": "Dr. Amelia Hartford",
          "age": 45,
          "profession": "Archaeologist",
          "personality": "Intelligent, curious, and determined",
          "role": "Discovered an ancient dragon relic, currently researching its origins.",
          "mystery_intrigue": "Believes the relic holds a powerful secret, possibly related to the mythical creatures of old."
        }
      },
      "player-2": {
        "profile": {
          "name": "Alexander Blackwood",
          "age": 28,
          "profession": "Adventurer",
          "personality": "Brave, adventurous, and resourceful",
          "role": "Frequently travels to hidden and dangerous locations, seeking ancient treasures.",
          "mystery_intrigue": "Has a mysterious dragon tattoo, which he believes is connected to his destiny and the end of the world."
        }
      },
      "player-3": {
        "profile": {
          "name": "Prof. Marcus Ravenwood",
          "age": 60,
          "profession": "Historian",
          "personality": "Wise, scholarly, and secretive",
          "role": "Expert in ancient myths and legends, particularly dragons.",
          "mystery_intrigue": "Holds a key piece of information about an ancient dragon prophecy, which he keeps hidden from the world."
        }
      }
    },
    "wagon-2": {
      "player-1": {
        "profile": {
          "name": "Dr. Olivia Hartford",
          "age": 42,
          "profession": "Geologist",
          "personality": "Intellectual, reserved, and meticulous",
          "role": "Conducts research on rare Earth metals, particularly interested in a new, indestructible metal.",
          "mystery_intrigue": "Discovered the properties of the rare metal after studying ancient artifacts, close to revealing its origins."
        }
      },
      "player-2": {
        "profile": {
          "name": "Elias Blackwood",
          "age": 30,
          "profession": "Blacksmith",
          "personality": "Strong-willed, rugged, and loyal",
          "role": "Crafts weapons and tools from unusual metals, recently received an anonymous commission to forge a special item.",
          "mystery_intrigue": "Knows the secret smelting process for the indestructible metal, handed down through his family for generations."
        }
      },
      "player-3": {
        "profile": {
          "name": "Seraphina Vale",
          "age": 28,
          "profession": "Historian",
          "personality": "Curious, imaginative, and passionate",
          "role": "Studies ancient civilizations, recently found a hidden map leading to a forgotten mine.",
          "mystery_intrigue": "Possesses a piece of an ancient manuscript that hints at a metal capable of resisting any force, seeks to decipher its meaning."
        }
      },
      "player-4": {
        "profile": {
          "name": "Prof. Alfred Mason",
          "age": 58,
          "profession": "Archaeologist",
          "personality": "Analytical, patient, and scholarly",
          "role": "Uncovers ancient artifacts, recently discovered a strange metal artifact from a lost civilization.",
          "mystery_intrigue": "The artifact he found is made of the same indestructible metal, links to an ancient legend of eternal strength."
        }
      },
      "player-5": {
        "profile": {
          "name": "Lila Stone",
          "age": 22,
          "profession": "Jeweler",
          "personality": "Creative, determined, and ambitious",
          "role": "Designs and crafts unique jewelry, recently acquired a rare metal to create an exclusive collection.",
          "mystery_intrigue": "The rare metal she acquired is the same as the one mentioned in the ancient manuscript, unaware of its true value."
        }
      },
      "player-6": {
        "profile": {
          "name": "Det. Noah Thompson",
          "age": 45,
          "profession": "Detective",
          "personality": "Diligent, intuitive, and just",
          "role": "Investigates a series of thefts related to rare metals, recently discovered a link to an underground market.",
          "mystery_intrigue": "Closely tracking the movements of the indestructible metal, believes it is the key to solving his case."
        }
      },
      "player-7": {
        "profile": {
          "name": "Sir Richard LeFevre",
          "age": 65,
          "profession": "Antiquities Collector",
          "personality": "Elegant, shrewd, and eccentric",
          "role": "Collects rare and valuable antiques, recently acquired an ancient metal ingot from a mysterious source.",
          "mystery_intrigue": "The ingot he possesses is made of the indestructible metal, knows its true worth and the legends surrounding it."
        }
      }
    }
  }
}