{
  "player_details": {
    "wagon-1": {
      "player-1": {
        "profile": {
          "name": "Victor Sterling",
          "age": 55,
          "profession": "Mining Magnate",
          "personality": "Ambitious, cunning, and charismatic",
          "role": "Owns a vast mining empire, recently discovered a new vein of precious metal with a peculiar luster.",
          "mystery_intrigue": "Secretly trades in unregistered precious metals, hiding a fortune in a secure vault."
        }
      },
      "player-2": {
        "profile": {
          "name": "Isabella Hart",
          "age": 38,
          "profession": "Jewelry Designer",
          "personality": "Creative, passionate, and meticulous",
          "role": "Designs exquisite jewelry for the elite, recently commissioned to create pieces from a rare, gleaming metal.",
          "mystery_intrigue": "Receives anonymous shipments of raw, lustrous metal, unaware of its true origin."
        }
      },
      "player-3": {
        "profile": {
          "name": "Lucas Ford",
          "age": 42,
          "profession": "Financial Advisor",
          "personality": "Analytical, cautious, and strategic",
          "role": "Manages the investments of wealthy clients, notices unusual transactions involving large amounts of gleaming bullion.",
          "mystery_intrigue": "Suspects a client of illegal trading in unregistered precious metals, but lacks concrete evidence."
        }
      },
      "player-4": {
        "profile": {
          "name": "Eleanor Brooks",
          "age": 32,
          "profession": "Investigative Journalist",
          "personality": "Tenacious, curious, and ethical",
          "role": "Investigates corruption in the mining industry, follows a lead on a hidden stash of radiant metal bars.",
          "mystery_intrigue": "Uncovers a network of illegal precious metal trades, putting her life in danger."
        }
      }
    },
    "wagon-2": {
      "player-1": {
        "profile": {
          "name": "Adrian North",
          "age": 38,
          "profession": "Adventurer and Cartographer",
          "personality": "Brave, curious, and determined",
          "role": "Leads the expedition through uncharted territories, using an antique navigation tool with a unique magnetic needle.",
          "mystery_intrigue": "Carries a mysterious map that seems to guide them towards a hidden treasure, but the map has strange symbols that no one can decipher."
        }
      },
      "player-2": {
        "profile": {
          "name": "Elena Stone",
          "age": 32,
          "profession": "Archaeologist",
          "personality": "Intelligent, meticulous, and resourceful",
          "role": "Studies ancient artifacts found along the journey, including a small, intricately designed metal disk.",
          "mystery_intrigue": "Has discovered clues suggesting the existence of a lost civilization, but keeps this information secret from the team."
        }
      },
      "player-3": {
        "profile": {
          "name": "Lucas West",
          "age": 28,
          "profession": "Botanist",
          "personality": "Analytical, patient, and nurturing",
          "role": "Identifies and documents new plant species, often seen with a small, engraved metal case containing rare seeds.",
          "mystery_intrigue": "Finds a rare plant that has healing properties, but its location is marked by a peculiar symbol that resembles a directional pointer."
        }
      },
      "player-4": {
        "profile": {
          "name": "Sophia East",
          "age": 35,
          "profession": "Linguist",
          "personality": "Insightful, empathetic, and communicative",
          "role": "Deciphers ancient languages and symbols encountered during the expedition, carries a small, ornate metal pendant.",
          "mystery_intrigue": "Uncovers a hidden language that seems to provide directions to a mysterious artifact, but the language is unlike anything she has ever seen."
        }
      }
    }
  }
}